{
  "profile": {
    "navbar": [
      {
        "href": "about",
        "name": "About Me",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "experience",
        "name": "Experience",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "education",
        "name": "Education",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "skills",
        "name": "Skills",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "portofolio",
        "name": "Portofolio",
        "scrollable": false,
        "disabled": false
      },
      {
        "href": "articles",
        "name": "Articles",
        "scrollable": false,
        "disabled": false
      }
    ],
    "user": {
      "name": "DIKO MAHENDRA",
      "position": "Frontend Developer",
      "whatsapp": "+628-2384-8980-30",
      "email": "diko.dev99@gmail.com",
      "title_social_media": "Social Media",
      "button_download": "Download Resume",
      "social_media": [
        {
          "url": "https://web.facebook.com/diko.mahendra.790",
          "name": "Facebook"
        },
        {
          "url": "https://www.instagram.com/dikomahendr4/",
          "name": "Instagram"
        },
        {
          "url": "https://www.linkedin.com/in/diko-mahendra/",
          "name": "Linkedin"
        },
        {
          "url": "https://github.com/DikoMahendraa",
          "name": "Github"
        }
      ]
    },
    "educations": {
      "title_education": "Education",
      "schools": [
        {
          "name": "SMK Negeri 1 Rawajitu Selatan",
          "major": "Computer & Network Engineering",
          "since": "2017 - May 2019",
          "place": "Tulang Bawang, Lampung, Indonesia."
        },
        {
          "name": "Pondok IT QODR",
          "major": "Frontend Developer",
          "since": "Jul 2019 - Jan 2022",
          "place": "Bantul Dligno, Yogyakarta - Indonesia"
        }
      ]
    },
    "experiences": {
      "title_experience": "Experiences",
      "company": [
        {
          "name": "Virtual Spirit Sdn Bhd",
          "position": "Frontend Developer",
          "time": "April 2023 - presently",
          "country": "Slangor - Malaysia",
          "techonology": "Git, NextJS, Typescript, (Jest, RTL, Cypress), i18n, React Query, React Hooks Form, Jotai, Zod, TailwindCSS.",
          "title_tech_used": "Technology & Tools used:",
          "description": [
            "Revamp old UI to new UI",
            "Implement responsive design for desktop, tablet and mobile using tailwindCSS",
            "Performed unit test for each component, utils and page.",
            "Added some new features for landlord, tenant, and professional roles.",
            "Implemented clean code, adjusted packages modules to the latest version, implemented e2e test using cypress, made folder architecture more readable, implemented storybook for each component, and participated in the process of raising code to production, branch registration to AWS amplify, and adding environment variables in AWS.",
            "Worked with the team, from FE, BE QA and also PM."
          ]
        },
        {
          "name": "PT. Telkom Indonesia",
          "position": "Frontend Engineer",
          "time": "Jan 2022 - Jun 2023",
          "techonology": "Git, Jira, NextJs, (Jest, RTL), i18n, React Hooks Form, Redux, TailwindCSS.",
          "title_tech_used": "Technology & Tools used:",
          "country": "Jakarta Selatan - Indonesia",
          "description": [
            "Fixed several bugs on the agree website, from the appearance to the integratino process.",
            "implement responsive web design for desktop., tablet, and mobile display with perfect pixel (accuracy and similiarity with design / UI on figma 99% ).",
            "Negotiate with UI/UX team for a look that is difficult to develop by Frontend Team.",
            "Contributed to the development of new features for agreepedia, ask experts and discussion forums.",
            "The development process uses agile methods, which include retro, sprint planning, development, review, and release.",
            "Implemented language change features for English and indonesia.",
            "Minimize the use of modules or packages that are needed while they can still be made or modified by yourself.",
            "Create unit tests on component, utilities, and pages, with coverage above 85% to pass the code quality check on sentry",
            "Apply clean code to all code created.",
            "Work with teams, from FE, BE, QA, UI/UX, and PM."
          ]
        },
        {
          "name": "PT. Kaldu Sari Nabati",
          "position": "Frontend Engineer",
          "techonology": "Git, NextJS, Typescript, i18n, React Query, React Hooks Form",
          "title_tech_used": "Technology & Tools used:",
          "time": "May 2022 - Sept 2022",
          "country": "Bandung, Indonesia",
          "description": [
            "Added several features to the internal dashboard for product management, as well as adjusting some of the available features according to their respective roles.",
            "Participated in meetings with clients and presented related progress and features that have been developed.",
            "Added the registration feature into several steps, namely registering with email and cellphone number and verifying the data of the cellphone number and email.",
            "Integrate with endpoints that have been provided by the Backend.",
            "Worked with teams, from FE, BE and PM."
          ]
        }
      ]
    },
    "about": {
      "title_aboutme": "About Me",
      "description": "I am web developer with ± 3 years of experience using NextJs, React Js and also React Native. interested in learning new things, used to working under pressure, working well with team, used to working remotely and ready to adjust skills according to company needs."
    },
    "skills": {
      "title_skills": "Skills",
      "title_programming": "Programming Languages",
      "title_library": "Library / Framework / Services",
      "title_tools": "Tools",
      "programming": ["Javascript", "Typescript"],
      "library": [
        "React Js",
        "Next Js",
        "Firebase",
        "Git",
        "TailwindCSS",
        "REST API"
      ],
      "tools": ["Postman", "Figma", "Jira"]
    },
    "portofolio": {
      "alert": "Warning: Some projects may no longer be available due to several factors (missing documentation, privacy issues, project no longer running).",
      "label_role": "position",
      "label_description": "What did you do?",
      "label_tech_used": "What are the technologies used?",
      "personal": [
        {
          "images": "/portofolio/personal/burgerapp.png",
          "name": "Burger City",
          "description": "Slicing UI using React Native, installing and running the React Native CLI application, running RN projects on real devices via usb cable and Wifi network. reusable and refactoring code.",
          "available": true,
          "role": "React Native Developer",
          "tech": "React Native",
          "link": ""
        },
        {
          "images": "/portofolio/personal/tartile.png",
          "name": "Tartil Me",
          "description": "Initializing the project using NuxtJs, slicing pages and components, implementing clean code. adding some features for searching surahs, qori etc. integrating with data created by the backend.",
          "available": true,
          "role": "Frontend Developer",
          "tech": "NuxtJs, Bootstrap",
          "link": ""
        },
        {
          "images": "/portofolio/personal/doctor.png",
          "name": "My Doctor",
          "description": "Followed the course from 0, starting from RN project setup, slicing components. using atomic design pattern, integrating with firebase for authentication and for chat features.",
          "available": true,
          "role": "React Native Developer",
          "tech": "React Native, Firebase",
          "link": ""
        },
        {
          "images": "/portofolio/personal/financial.png",
          "name": "Financial Planner",
          "description": "Determine the technology to be used, apply atomic design pattern as a folder structure. apply clean code and reusable components. integration with firebase.",
          "available": true,
          "role": "Frontend Developer",
          "tech": "NextJs, Typescript, Firebase, TailwindCSS",
          "link": ""
        },
        {
          "images": "/portofolio/personal/taskio.png",
          "name": "Task IO",
          "description": "mencari inspirasi design di dribble, melakukan modifikasi dan menambahkan beberapa UI baru menggunakan tools figma, menerapkan atomic design pattern sebagai folder struktur. menerapkan clean code dan reusable component. slicing UI dan integrasi dengan Supabase",
          "available": true,
          "role": "NextJs, Typescript, Supabase, TailwindCSS, figma",
          "tech": "React Native",
          "link": ""
        }
      ],
      "company": [
        {
          "images": "/portofolio/company/vtr.png",
          "name": "VTR",
          "description": "Help clean up messy code to become reusable and refactor, fix bugs in Frontend code. continue to help mentoring QA for automation using cypress. implement unit testing using Jest, learn how to deploy applications to production, learn how to register branches to AWS amplify, continue to learn sharing sessions every month with Frontend friends and much more.",
          "role": "Frontend Engineer",
          "tech": "NextJs, Typescript, i18n, Jotai, Zod, React Hook Form, React Query, TailwindCSS, Jest, Cypress",
          "link": "https://vtrconnect.com",
          "available": true
        },
        {
          "images": "/portofolio/company/agree.png",
          "name": "Agreeculture.id",
          "role": "Frontend Engineer",
          "description": "Fixed bugs in the Frontend code, added some new features such as Ask an Expert, Agreepedia, and also the Discussion Forum. I also participated in the migration process for responsive design (mobile, tablet, & desktop). nerapin clean code, and many more.",
          "tech": "NextJs, i18n, TailwindCSS, styled-component, redux, react hooks form.",
          "available": true,
          "link": "agreeculture.id"
        },
        {
          "images": "/portofolio/company/nabati.png",
          "name": "Dashboard Zeus & Hermes",
          "description": "Maintenance of Zeus dashboard and also Hermes for product management, add some CRUD features in the dashboard. integration with Rest API. and add translation feature (i18n) in the dashboard.",
          "role": "Frontend Developer",
          "tech": "NextJs, Typescript, i18n, Micro Frontend, AntDesign, Jira, React Storybook, Styled Component.",
          "available": false,
          "link": "not available to show"
        },
        {
          "images": "/portofolio/company/dana.png",
          "name": "Dana Syariah",
          "description": "Help develop from 0 for web applications starting from the landing page & also the dsahboard, installation of several modules / packages needed, implementation of storybooks for component maintenance to make the development process much faster, installation of language features (i18n), continue to help develop existing applications using React Native, add some features and also refactoring code and folder structure that is messy.",
          "available": true,
          "role": "Frontend Web & Mobile React Native",
          "tech": "React Native, NextJs, Typescript, i18n, React Storybook, AntDesign, Redux.",
          "link": ""
        },
        {
          "images": "/portofolio/company/not-found.png",
          "name": "Mirocks Insurance - India",
          "description": "I actually learned more here, starting from communicating and presenting in English. learning new technologies such as GraphQL and Typescript, learning about clean code. and fixing some bugs in the interface, adding some new features such as uploading documents and form validation.",
          "role": "Internship Frontend Developer",
          "tech": "GraphQL, typescript, Nextjs, AntDesign Pro, i18n, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/certie.png",
          "name": "Certie",
          "description": "create a web application from 0, discuss with BE, PM and also the client regarding the project to be worked on, find a UI template that is suitable for the project. learn UI/UX and figma as design tools, create project architecture with atomic design patterns. then deploy the project to cpanel.",
          "role": "Frontend Engineer",
          "tech": "ReactJs, Nextjs, Javascript, TailwindCSS, Ant Design, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/hobids.png",
          "name": "Hobids",
          "description": "Create a web application from 0, discuss with BE, PM and also the client regarding the project to be worked on, realize the UI figma into the code. determine the folder architecture in FE, and present to the client regarding the appearance and prototype that has been done.",
          "role": "Frontend Engineer",
          "tech": "ReactJs, Nextjs, Javascript, TailwindCSS, Ant Design, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/zurich.png",
          "name": "Dashboard Zurich Insurance",
          "description": "Create dashboard management from 0, add some analytics features, signed docs, activity logs, user management, and also all data (pending, invalid, rejected and verified), work with the team. then apply state management using vuex.",
          "role": "Junior Frontend Developer",
          "tech": "VueJs, NuxtJs, Vuetify, Vuex.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/qatros.png",
          "name": "Landing Page Qatros",
          "role": "Junior Frontend Developer",
          "description": "learning vuejs for 1 week, then direct implementation by developing landing pages (with a new UI) for internal companies, learning to work with teams, discussing new technologies, and conducting sharing sessions in the office.",
          "tech": "VueJs, Bootstrap",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/liveness.png",
          "name": "Liveness Detection",
          "role": "Junior Frontend Developer",
          "description": "Create a landing page for the livenesss detection application from 0, make it responsive design for desktop, tablet, and mobile. implement 3D assets for gesture and expression using ThreeJs, and package integration for liveness detection.",
          "tech": "Bootstrap, NuxtJs, ThreeJs, Blender, Liveness Module",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/company/woowa.png",
          "name": "Woowa Dashboard",
          "role": "Internship Frontend Developer",
          "description": "Choosing a suitable template for Woowa Dashboard, modifying the template that has been purchased and then adjusting it to the display needs needed. learning to use the css framework and also state management redux. learning to work with a team and using git as a tool for collaboration.",
          "tech": "ReactJs, Dashboard Template, Redux, Bootstrap.",
          "link": "",
          "available": false
        }
      ]
    }
  },
  "notFound": {
    "heading": "404 - Ups",
    "description": "Sorry, Page not found.",
    "buttonBack": "Main page"
  }
}
