{
  "profile": {
    "navbar": [
      {
        "href": "about",
        "name": "Tentang Saya",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "experience",
        "name": "Pengalaman Kerja",
        "disabled": false,
        "scrollable": true
      },
      {
        "href": "education",
        "name": "Pendidikan",
        "scrollable": true,
        "disabled": false
      },
      {
        "href": "skills",
        "name": "Keahlian",
        "scrollable": true,
        "disabled": false
      },
      {
        "href": "portofolio",
        "name": "Portofolio",
        "scrollable": false,
        "disabled": false
      },
      {
        "href": "articles",
        "name": "Artikel",
        "scrollable": false,
        "disabled": false
      }
    ],
    "user": {
      "name": "DIKO MAHENDRA",
      "position": "Frontend Developer",
      "whatsapp": "+628-2384-8980-30",
      "email": "diko.dev99@gmail.com",
      "title_social_media": "Sosial Media",
      "button_download": "Unduh Resume",
      "social_media": [
        {
          "url": "https://web.facebook.com/diko.mahendra.790",
          "name": "Facebook"
        },
        {
          "url": "https://www.instagram.com/dikomahendr4/",
          "name": "Instagram"
        },
        {
          "url": "https://www.linkedin.com/in/diko-mahendra/",
          "name": "Linkedin"
        },
        {
          "url": "https://github.com/DikoMahendraa",
          "name": "Github"
        }
      ]
    },
    "educations": {
      "title_education": "Pendidikan",
      "schools": [
        {
          "name": "SMK Negeri 1 Rawajitu Selatan",
          "major": "Teknik Komputer & Jaringan",
          "since": "2017 - Mei 2019",
          "place": "Tulang Bawang, Lampung, Indonesia."
        },
        {
          "name": "Pondok IT QODR",
          "major": "Frontend Developer",
          "since": "Jul 2019 - Jan 2022",
          "place": "Bantul Dligno, Yogyakarta - Indonesia"
        }
      ]
    },
    "experiences": {
      "title_experience": "Pengalaman Kerja",
      "company": [
        {
          "name": "Virtual Spirit Sdn Bhd",
          "position": "Frontend Developer",
          "time": "April 2023 - sekarang",
          "country": "Slangor - Malaysia",
          "techonology": "Git, NextJS, Typescript, (Jest, RTL, Cypress), i18n, React Query, React Hooks Form, Jotai, Zod, TailwindCSS.",
          "title_tech_used": "Teknologi & Tools yg digunakan:",
          "description": [
            "Merubah UI lama ke UI baru.",
            "Menerapkan responsive design untuk desktop, tablet, dan juga mobile menggunakan tailwindcss",
            "Melakukan unit test untuk setiap component, utils dan halaman.",
            "Menambahkan beberapa fitur baru untuk role landlord, tenant, dan juga professional.",
            "Menerapkan clean code, menyesuaikan package/module ke versi terbaru, menerapkan e2e test menggunakan cypress, merapihkan arsitektur folder lebih readable, menerapkan storybook untuk setiap component, dan ikut serta dalam proses menaikan code ke production, registrasi branch ke AWS amplify, dan menambahkan environment variable di AWS.",
            "Bekerja dengan tim, mulai dari FE, BE, QA dan juga PM."
          ]
        },
        {
          "name": "PT. Telkom Indonesia",
          "position": "Frontend Engineer",
          "time": "Jan 2022 - Jun 2023",
          "country": "Jakarta Selatan - Indonesia",
          "techonology": "Git, Jira, NextJs, (Jest, RTL), i18n, React Hooks Form, Redux, TailwindCSS.",
          "title_tech_used": "Teknologi & Tools yg digunakan:",
          "description": [
            "Memperbaiki beberapa bug yg ada pada website agree, mulai dari tampilan hingga proses integrasi.",
            "Menerapkan responsive web design untuk tampilan desktop, tablet, dan juga mobile dengan perfect pixel (akurasi dan kesamaan dengan design / UI pada figma 99%).",
            "Melakukan negosiasi dengan tim UI/UX terhadap sebuah tampilan yg di rasa sulit untuk dikembangkan oleh tim Frontend.",
            "Ikut berkontribusi dalam pengembangan fitur baru untuk agreepedia, tanya ahli serta forum diskusi.",
            "Proses development menggunakan metode agile, yg dimana terdapat retro, sprint planning, development, review, rilis.",
            "Menerapakn fitur perubahan bahasa untuk inggris dan indonesia.",
            "Meminimalisir penggunaan module atau package yg dibutuhkan selagi masih bisa dibuat atau di modifikasi sendiri.",
            "Membuat unit testing terhadap component, utils, serta halaman. dengan coverage di atas 85% untuk lolos pada pengecekan kualitas code pada sentry.",
            "Menerapkan clean code terhadap seluruh code yg dibuat.",
            "Bekerja dengan tim mulai dari FE, BE, QA , UI/UX, dan juga PM."
          ]
        },
        {
          "name": "PT. Kaldu Sari Nabati",
          "position": "Frontend Engineer",
          "time": "May 2022 - Sept 2022",
          "country": "Bandung, Indonesia",
          "techonology": "Git, NextJS, Typescript, i18n, React Query, React Hooks Form",
          "title_tech_used": "Teknologi & Tools yg digunakan:",
          "description": [
            "Menambahkan beberapa fitur pada dashboard internal untuk management product, serta menyesuaikan beberapa fitur yg tersedia sesuai dengan role nya masing-masingß",
            "Ikut hadir dalam meeting dengan client serta mempresentasikan terkait progress serta fitur yg sudah selesai dikembangkanß",
            "Menambahkan fitur registrasi menjadi beberapa langkah yaitu mendaftar dengan email dan juga nomor hp serta melakukan verifikasi terhadap data tersebut nomor hp dan juga email tersebutß",
            "Melakukan integrasi dengan endpoint yg sudah disediakan oleh backendß",
            "Bekerja dengan tim, mulai dari FE, BE, dan juga PM."
          ]
        }
      ]
    },
    "about": {
      "title_aboutme": "Tentang Saya",
      "description": "Saya seorang Web Developer dengan pengalaman ± 3 tahun menggunakan NextJs, React Js dan juga React Native. tertarik untuk belajar hal baru, terbiasa bekerja dibawah tekanan, bekerja dengan baik dengan tim, terbiasa bekerja remote dan siap menyesuaikan skill sesui dengan kebutuhan perusahaan."
    },
    "skills": {
      "title_skills": "Keahlian",
      "title_programming": "Bahasa Pemograman",
      "title_library": "Library / Framework / Services",
      "title_tools": "Alat & Bantuan",
      "programming": ["Javascript", "Typescript"],
      "library": [
        "React Js",
        "Next Js",
        "Firebase",
        "Git",
        "TailwindCSS",
        "REST API"
      ],
      "tools": ["Postman", "Figma", "Jira"]
    },
    "portofolio": {
      "alert": "Peringatan: Beberapa proyek mungkin tidak lagi tersedia karena beberapa faktor (dokumentasi yang hilang, masalah privasi, proyek tidak lagi berjalan).",
      "label_role": "Jabatan",
      "label_description": "Ngapain aja ?",
      "label_tech_used": "Teknologi yg dipake ?",
      "personal": [],
      "company": [
        {
          "images": "/portofolio/vtr.png",
          "name": "VTR",
          "description": "Bantu ngerapihin kode yg berantakan buat jadi reusable dan direfactor, benerin bug di code Frontend. terus bantu mentoring QA buat automation pakai cypress. implementasi unit testing pake Jest, belajar cara deploy aplikasi ke production, belajar cara register branch ke AWS amplify, terus belajar sharing session tiap bulan bareng temen2 Frontend dan masih banyak lagi",
          "role": "Frontend Engineer",
          "tech": "NextJs, Typescript, i18n, Jotai, Zod, React Hook Form, React Query, TailwindCSS, Jest, Cypress",
          "link": "https://vtrconnect.com",
          "available": true
        },
        {
          "images": "/portofolio/agree.png",
          "name": "Agreeculture.id",
          "role": "Frontend Engineer",
          "description": "Benerin bug di kode Frontend, nambahin beberapa fitur baru kayak Tanya Ahli, Agreepedia, dan juga Forum Diskusi. aku juga ikut proses migrasi untuk responsive design (mobile, tablet, & desktop). nerapin clean code, dan masih banyak lagi",
          "tech": "NextJs, i18n, TailwindCSS, styled-component, redux, react hooks form.",
          "available": true,
          "link": "agreeculture.id"
        },
        {
          "images": "/portofolio/nabati.png",
          "name": "Dashboard Zeus & Hermes",
          "description": "Maintenance dashboard Zeus dan juga Hermes untuk management produk, nambahin beberapa fitur CRUD di dashboardnya. integrasi dengan Rest API. dan nambahin fitur translation (i18n) di dashboardnya.",
          "role": "Frontend Developer",
          "tech": "NextJs, Typescript, i18n, Micro Frontend, AntDesign, Jira, React Storybook, Styled Component.",
          "available": false,
          "link": "not available to show"
        },
        {
          "images": "/portofolio/dana.png",
          "name": "Dana Syariah",
          "description": "Bantu develop dari 0 untuk aplikasi web mulai dari landing page & juga dsahboardnya, instalasi beberapa module/package yg diperlukan, implementasi storybook untuk maintenance component biar proses development jauh lebih cepat, instalasi fitur bahasa (i18n), terus ikut bantu develop aplikasi yg sudah ada menggunakan React Native, nambahin beberapa fitur dan juga refactoring code dan folder struktur yg berantakan.",
          "available": true,
          "role": "Frontend Web & Mobile React Native",
          "tech": "React Native, NextJs, Typescript, i18n, React Storybook, AntDesign, Redux.",
          "link": ""
        },
        {
          "images": "/portofolio/not-found.png",
          "name": "Mirocks Insurance - India",
          "description": "sebenernya disini aku lebih banyak belajar, mulai dari berkomunikasi dan presentasi pakai bahasa inggris. belajar teknologoi baru seperti GraphQL dan juga Typescript, belajar tentang clean code. dan memperbaiki beberapa bug pada tampilan, menambahkan beberapa fitur baru seperti upload documentsnya dan juga validasi form.",
          "role": "Internship Frontend Developer",
          "tech": "GraphQL, typescript, Nextjs, AntDesign Pro, i18n, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/certie.png",
          "name": "Certie",
          "description": "buat aplikasi web dari 0, diskusi bareng BE, PM dan juga client terkait project yg akan dikerjakan, nyari template UI yg cocok untuk project tsb. belajar UI/UX dan figma sebagai tools design, buat arsitektur project dengan atomic design pattern. terus deployment project ke cpanel",
          "role": "Frontend Engineer",
          "tech": "ReactJs, Nextjs, Javascript, TailwindCSS, Ant Design, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/hobids.png",
          "name": "Hobids",
          "description": "buat aplikasi web dari 0, diskusi bareng BE, PM dan juga client terkait project yg akan dikerjakan, merealisasikan UI figma ke dalam kode. menentukan arsitektur folder pada FE, dan mempresentasikan ke client terkait tampilan dan prototype yg sudah dkerjakan.",
          "role": "Frontend Engineer",
          "tech": "ReactJs, Nextjs, Javascript, TailwindCSS, Ant Design, Redux.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/zurich.png",
          "name": "Dashboard Zurich Insurance",
          "description": "buat dashboard management dari 0, nambahin beberapa fitur analisa, signed docs, activity log, user management, dan juga semua data (pending, invalid, ditolak dan verifikasi), bekerja bareng tim. terus nerapin state management pake vuex.",
          "role": "Junior Frontend Developer",
          "tech": "VueJs, NuxtJs, Vuetify, Vuex.",
          "link": "",
          "available": false
        },
        {
          "images": "/portofolio/qatros.png",
          "name": "Landing Page Qatros",
          "role": "Junior Frontend Developer",
          "description": "belajar vuejs selama 1 pekan, kemudian impelementasi langsung dengan cara ngedevelop landing page (dengan tampilan UI yg baru) untuk internal perusahaan, belajar bekerja bareng tim, diskusi terkait teknologi baru, dan ngisi sharing session di kantor",
          "tech": "VueJs, Bootstrap",
          "link": "",
          "available": false
        }
      ]
    }
  },
  "notFound": {
    "heading": "404 - Ups",
    "description": "Maaf, halaman yang Anda cari tidak ditemukan.",
    "buttonBack": " Halaman utama"
  }
}
